{
  "Lines": [
    {
      "name": "Staff",
      "definition": "The five-line staff (often \"stave\" in British usage) is used to indicate pitch. Each line or space indicates the pitch belonging to a note with a letter name: A, B, C, D, E, F, G. Moving vertically upwards, the letter names proceed alphabetically with the alternating lines and spaces, and represent ascending pitches. The A-G pattern repeats—the note above \"G\" is another \"A\". "
    },
    {
      "name": "Ledger",
      "definition": "These additional lines (and the spaces they form) indicate pitches above or below the staff. The diagram shows a single ledger line above and below the staff but multiple ledger lines can be used."
    },
    {
      "name": "Barline",
      "definition": "Bar lines separate measures (\"bars\") of music according to the indicated time signature. They sometimes extend through multiple staves to group them together when a grand staff is used or when indicating groups of similar instruments in a conductor's score."
    }
  ],
  "Clefs": [
    {
      "name": "C Clef",
      "definition": "A symbol indicating which line of a staff represents the pitch of middle C. On the bottom line it becomes the soprano clef, on the middle line the alto clef, and on the third line above the bottom the tenor clef. "
    },
    {
      "name": "G Clef",
      "definition": "The spiral of a G clef shows where the G above middle C is located on the staff. A G clef with the spiral on the second line of the staff is called treble clef. The treble clef is the most commonly encountered clef in modern notation. "
    },
    {
      "name": "F Clef",
      "definition": "An F clef places the F below middle C on the line between the dots. When placing the F below middle C on the fourth line, it is called bass clef, which is by far its most common usage. "
    }
  ],
  "Notes": [
    {
      "name": "Whole Note",
      "definition": "The whole note or semibreve has a note head in the shape of a hollow oval—like a half note (or minim) — but with no note stem. Since it is equal to four beats in 4/4 time, it occupies the entire length of a measure in that time signature."
    },
    {
      "name": "Double Whole Note",
      "definition": "A double whole note (American), breve (British), or double note is a note lasting two times as long as a whole note (or semibreve)."
    },
    {
      "name": "Half Note",
      "definition": "A half note (American) or minim (British) is a note played for half the duration of a whole note (or semibreve) and twice the duration of a quarter note (or crotchet)."
    },
    {
      "name": "Quarter Note",
      "definition": "A quarter note (American) or crotchet (British) is a note played for one quarter of the duration of a whole note (or semibreve)."
    },
    {
      "name": "Eighth Note",
      "definition": "An eighth note (American) or a quaver (British) is a musical note played for one eighth the duration of a whole note (semibreve)."
    },
    {
      "name": "Sixteenth Note",
      "definition": "A sixteenth note (American) or semiquaver (British) is a note played for half the duration of an eighth note (quaver)."
    },
    {
      "name": "Thirty-second Note",
      "definition": "A thirty-second note (American) or demisemiquaver (British) is a note played for ​1⁄32 of the duration of a whole note (or semibreve). It lasts half as long as a sixteenth note (or semiquaver) and twice as long as a sixty-fourth (or hemidemisemiquaver)."
    },
    {
      "name": "Sixty-fourth Note",
      "definition": "A sixty-fourth note (American), or hemidemisemiquaver or semidemisemiquaver (British), sometimes called a half-thirty-second note, is a note played for half the duration of a thirty-second note (or demisemiquaver)."
    },
    {
      "name": "Hundred twenty-eighth note",
      "definition": "A hundred twenty-eighth note or semihemidemisemiquaver or quasihemidemisemiquaver is a note played for ​1⁄128 of the duration of a whole note."
    }
  ],
  "Rests": [
    {
      "name": "Whole Rest",
      "definition": "A pause or rest in a composition having the time duration of a whole note."
    },
    {
      "name": "Double Whole Rest",
      "definition": "In common time (4/4, C), the double whole rest has a value of eight beats."
    },
    {
      "name": "Half Rest",
      "definition": "A pause or rest in a composition having the duration of one half of a whole rest."
    },
    {
      "name": "Quarter Rest",
      "definition": "A pause or rest having the time duration of one fourth of the time duration of a whole rest."
    },
    {
      "name": "Sixteenth Rest",
      "definition": "A pause or rest in a composition having the time duration of one eighth of the time duration of a whole rest."
    },
    {
      "name": "Thirty-second Rest",
      "definition": "A pause or rest having the time duration of one thirty-second of the time duration of a whole rest."
    },
    {
      "name": "Thirty-second Rest",
      "definition": "A pause or rest having the time duration of one thirty-second of the time duration of a whole rest."
    },
    {
      "name": "Sixty-fourth Rest",
      "definition": "A pause or rest having the time duration of one sixty-fourth of the time duration of a whole rest."
    },
    {
      "name": "Multiple Measure Rest",
      "definition": "In instrumental parts, rests of more than one bar in the same meter and key may be indicated with a multimeasure rest (British English: multiple bar rest)."
    }
  ],
  "Articulations": [
    {
      "name": "Grace Note",
      "definition": "A grace note is a kind of music notation denoting several kinds of musical ornaments. It is usually printed smaller to indicate that it is melodically and harmonically nonessential. When occurring by itself, a single grace note normally indicates the intention of an acciaccatura. When they occur in groups, grace notes can be interpreted to indicate any of several different classes of ornamentation, depending on interpretation."
    },
    {
      "name": "Fermata",
      "definition": "A Fermata is a symbol of musical notation indicating that the note should be prolonged beyond the normal duration its note value would indicate. Exactly how much longer it is held is up to the discretion of the performer or conductor, but twice as long is common."
    },
    {
      "name": "Tie",
      "definition": "A tie is a curved line connecting the heads of two notes of the same pitch, indicating that they are to be played as a single note with a duration equal to the sum of the individual notes' values."
    }
  ],
  "Time Signatures": [
    {
      "name": "Simple Time Signature",
      "definition": "Simple time signatures consist of two numerals, one stacked above the other:\n1. The lower numeral indicates the note value that represents one beat (the beat unit). This number is typically a power of 2.\n2.The upper numeral indicates how many such beats constitute a bar.\nFor instance, 2/4 means two quarter-note (crotchet) beats per bar, while 3/8 means three eighth-note (quaver) beats per bar. The most common simple time signatures are 2/4, 3/4, and 4/4."
    },
    {
      "name": "Compound Time Signature",
      "definition": "In compound meter, subdivisions (which are what the upper number represents in these meters) of the beat are in three equal parts, so that a dotted note (half again longer than a regular note) becomes the beat. The upper numeral of compound time signatures is commonly 6, 9, or 12 (multiples of 3 in each beat). The lower number is most commonly an 8 (an eighth-note or quaver): as in 9/8 or 12/8."
    },
    {
      "name": "Complex Time Signature",
      "definition": "Signatures that do not fit the usual duple or triple categories are called complex. Examples of complex time signatures are 5/4 and 7/8."
    },
    {
      "name": "Mixed Time Signature",
      "definition": "While time signatures usually express a regular pattern of beat stresses continuing through a piece (or at least a section), sometimes composers place a different time signature at the beginning of each bar, resulting in music with an extremely irregular rhythmic feel. In this case, the time signatures are an aid to the performers and not necessarily an indication of meter. Examples of mixed time signatures are  5/8 & 3/8 or 6/8 & 3/4."
    }
  ],
  "Key Signatures": [
    {
      "name": "Flat",
      "definition": "An accidental symbol placed to the left of a note, indicating that its pitch should be lowered by a semitone (half step)."
    },
    {
      "name": "Sharp",
      "definition": "A symbol placed in front of a notehead which implies that the performer should raise the pitch of that note by a semitone."
    }
  ]
}